Revit 2027 API
StairsRunType.HasTreads Property
 True if the stairs run will include treads on steps, false otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasTreads { get; set; }
Public Property HasTreads As Boolean
	Get
	Set
public:
property bool HasTreads {
	bool get ();
	void set (bool value);
}
member HasTreads : bool with get, set
Property Value
Boolean
See Also
Reference
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace